app/controllers/api/v1/todolist_controller.rb

  def index
    todolists = Todolist.all
---
SELECT `todolists`.* FROM `todolists`

  def create
    todolists = Todolist.create!(todolist_params)
---
INSERT INTO `todolists` (`title`, `description`, `completed`, `created_at`, `updated_at`) VALUES ('Title', 'Description', FALSE, '2023-07-10 04:49:51.018955', '2023-07-10 04:49:51.018955')

  def update

    todo = Todolist.find(params[:id])
---
SELECT `todolists`.* FROM `todolists` WHERE `todolists`.`id` = 1 LIMIT 1